zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_usbfs.h
/* USBFS_USBDEV.EP0_DR */
#define USBFS_USBDEV_EP0_DR_DATA_BYTE_Pos       0UL
#define USBFS_USBDEV_EP0_DR_DATA_BYTE_Msk       0xFFUL
/* USBFS_USBDEV.CR0 */
#define USBFS_USBDEV_CR0_DEVICE_ADDRESS_Pos     0UL
#define USBFS_USBDEV_CR0_DEVICE_ADDRESS_Msk     0x7FUL
#define USBFS_USBDEV_CR0_USB_ENABLE_Pos         7UL
#define USBFS_USBDEV_CR0_USB_ENABLE_Msk         0x80UL
/* USBFS_USBDEV.CR1 */
#define USBFS_USBDEV_CR1_REG_ENABLE_Pos         0UL
#define USBFS_USBDEV_CR1_REG_ENABLE_Msk         0x1UL
#define USBFS_USBDEV_CR1_ENABLE_LOCK_Pos        1UL
#define USBFS_USBDEV_CR1_ENABLE_LOCK_Msk        0x2UL
#define USBFS_USBDEV_CR1_BUS_ACTIVITY_Pos       2UL
#define USBFS_USBDEV_CR1_BUS_ACTIVITY_Msk       0x4UL
#define USBFS_USBDEV_CR1_RESERVED_3_Pos         3UL
#define USBFS_USBDEV_CR1_RESERVED_3_Msk         0x8UL
/* USBFS_USBDEV.SIE_EP_INT_EN */
#define USBFS_USBDEV_SIE_EP_INT_EN_EP1_INTR_EN_Pos 0UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP1_INTR_EN_Msk 0x1UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP2_INTR_EN_Pos 1UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP2_INTR_EN_Msk 0x2UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP3_INTR_EN_Pos 2UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP3_INTR_EN_Msk 0x4UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP4_INTR_EN_Pos 3UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP4_INTR_EN_Msk 0x8UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP5_INTR_EN_Pos 4UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP5_INTR_EN_Msk 0x10UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP6_INTR_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP6_INTR_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP7_INTR_EN_Pos 6UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP7_INTR_EN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP8_INTR_EN_Pos 7UL
#define USBFS_USBDEV_SIE_EP_INT_EN_EP8_INTR_EN_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP_INT_SR */
#define USBFS_USBDEV_SIE_EP_INT_SR_EP1_INTR_Pos 0UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP1_INTR_Msk 0x1UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP2_INTR_Pos 1UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP2_INTR_Msk 0x2UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP3_INTR_Pos 2UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP3_INTR_Msk 0x4UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP4_INTR_Pos 3UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP4_INTR_Msk 0x8UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP5_INTR_Pos 4UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP5_INTR_Msk 0x10UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP6_INTR_Pos 5UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP6_INTR_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP7_INTR_Pos 6UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP7_INTR_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP8_INTR_Pos 7UL
#define USBFS_USBDEV_SIE_EP_INT_SR_EP8_INTR_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP1_CNT0 */
#define USBFS_USBDEV_SIE_EP1_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP1_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP1_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP1_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP1_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP1_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP1_CNT1 */
#define USBFS_USBDEV_SIE_EP1_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP1_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP1_CR0 */
#define USBFS_USBDEV_SIE_EP1_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP1_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP1_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP1_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP1_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP1_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP1_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP1_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP1_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP1_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.USBIO_CR0 */
#define USBFS_USBDEV_USBIO_CR0_RD_Pos           0UL
#define USBFS_USBDEV_USBIO_CR0_RD_Msk           0x1UL
#define USBFS_USBDEV_USBIO_CR0_TD_Pos           5UL
#define USBFS_USBDEV_USBIO_CR0_TD_Msk           0x20UL
#define USBFS_USBDEV_USBIO_CR0_TSE0_Pos         6UL
#define USBFS_USBDEV_USBIO_CR0_TSE0_Msk         0x40UL
#define USBFS_USBDEV_USBIO_CR0_TEN_Pos          7UL
#define USBFS_USBDEV_USBIO_CR0_TEN_Msk          0x80UL
/* USBFS_USBDEV.USBIO_CR2 */
#define USBFS_USBDEV_USBIO_CR2_RESERVED_5_0_Pos 0UL
#define USBFS_USBDEV_USBIO_CR2_RESERVED_5_0_Msk 0x3FUL
#define USBFS_USBDEV_USBIO_CR2_TEST_PKT_Pos     6UL
#define USBFS_USBDEV_USBIO_CR2_TEST_PKT_Msk     0x40UL
#define USBFS_USBDEV_USBIO_CR2_RESERVED_7_Pos   7UL
#define USBFS_USBDEV_USBIO_CR2_RESERVED_7_Msk   0x80UL
/* USBFS_USBDEV.USBIO_CR1 */
#define USBFS_USBDEV_USBIO_CR1_DMO_Pos          0UL
#define USBFS_USBDEV_USBIO_CR1_DMO_Msk          0x1UL
#define USBFS_USBDEV_USBIO_CR1_DPO_Pos          1UL
#define USBFS_USBDEV_USBIO_CR1_DPO_Msk          0x2UL
#define USBFS_USBDEV_USBIO_CR1_RESERVED_2_Pos   2UL
#define USBFS_USBDEV_USBIO_CR1_RESERVED_2_Msk   0x4UL
#define USBFS_USBDEV_USBIO_CR1_IOMODE_Pos       5UL
#define USBFS_USBDEV_USBIO_CR1_IOMODE_Msk       0x20UL
/* USBFS_USBDEV.DYN_RECONFIG */
#define USBFS_USBDEV_DYN_RECONFIG_DYN_CONFIG_EN_Pos 0UL
#define USBFS_USBDEV_DYN_RECONFIG_DYN_CONFIG_EN_Msk 0x1UL
#define USBFS_USBDEV_DYN_RECONFIG_DYN_RECONFIG_EPNO_Pos 1UL
#define USBFS_USBDEV_DYN_RECONFIG_DYN_RECONFIG_EPNO_Msk 0xEUL
#define USBFS_USBDEV_DYN_RECONFIG_DYN_RECONFIG_RDY_STS_Pos 4UL
#define USBFS_USBDEV_DYN_RECONFIG_DYN_RECONFIG_RDY_STS_Msk 0x10UL
/* USBFS_USBDEV.SOF0 */
#define USBFS_USBDEV_SOF0_FRAME_NUMBER_Pos      0UL
#define USBFS_USBDEV_SOF0_FRAME_NUMBER_Msk      0xFFUL
/* USBFS_USBDEV.SOF1 */
#define USBFS_USBDEV_SOF1_FRAME_NUMBER_MSB_Pos  0UL
#define USBFS_USBDEV_SOF1_FRAME_NUMBER_MSB_Msk  0x7UL
/* USBFS_USBDEV.SIE_EP2_CNT0 */
#define USBFS_USBDEV_SIE_EP2_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP2_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP2_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP2_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP2_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP2_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP2_CNT1 */
#define USBFS_USBDEV_SIE_EP2_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP2_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP2_CR0 */
#define USBFS_USBDEV_SIE_EP2_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP2_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP2_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP2_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP2_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP2_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP2_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP2_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP2_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP2_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.OSCLK_DR0 */
#define USBFS_USBDEV_OSCLK_DR0_ADDER_Pos        0UL
#define USBFS_USBDEV_OSCLK_DR0_ADDER_Msk        0xFFUL
/* USBFS_USBDEV.OSCLK_DR1 */
#define USBFS_USBDEV_OSCLK_DR1_ADDER_MSB_Pos    0UL
#define USBFS_USBDEV_OSCLK_DR1_ADDER_MSB_Msk    0x7FUL
/* USBFS_USBDEV.EP0_CR */
#define USBFS_USBDEV_EP0_CR_MODE_Pos            0UL
#define USBFS_USBDEV_EP0_CR_MODE_Msk            0xFUL
#define USBFS_USBDEV_EP0_CR_ACKED_TXN_Pos       4UL
#define USBFS_USBDEV_EP0_CR_ACKED_TXN_Msk       0x10UL
#define USBFS_USBDEV_EP0_CR_OUT_RCVD_Pos        5UL
#define USBFS_USBDEV_EP0_CR_OUT_RCVD_Msk        0x20UL
#define USBFS_USBDEV_EP0_CR_IN_RCVD_Pos         6UL
#define USBFS_USBDEV_EP0_CR_IN_RCVD_Msk         0x40UL
#define USBFS_USBDEV_EP0_CR_SETUP_RCVD_Pos      7UL
#define USBFS_USBDEV_EP0_CR_SETUP_RCVD_Msk      0x80UL
/* USBFS_USBDEV.EP0_CNT */
#define USBFS_USBDEV_EP0_CNT_BYTE_COUNT_Pos     0UL
#define USBFS_USBDEV_EP0_CNT_BYTE_COUNT_Msk     0xFUL
#define USBFS_USBDEV_EP0_CNT_DATA_VALID_Pos     6UL
#define USBFS_USBDEV_EP0_CNT_DATA_VALID_Msk     0x40UL
#define USBFS_USBDEV_EP0_CNT_DATA_TOGGLE_Pos    7UL
#define USBFS_USBDEV_EP0_CNT_DATA_TOGGLE_Msk    0x80UL
/* USBFS_USBDEV.SIE_EP3_CNT0 */
#define USBFS_USBDEV_SIE_EP3_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP3_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP3_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP3_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP3_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP3_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP3_CNT1 */
#define USBFS_USBDEV_SIE_EP3_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP3_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP3_CR0 */
#define USBFS_USBDEV_SIE_EP3_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP3_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP3_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP3_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP3_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP3_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP3_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP3_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP3_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP3_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.SIE_EP4_CNT0 */
#define USBFS_USBDEV_SIE_EP4_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP4_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP4_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP4_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP4_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP4_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP4_CNT1 */
#define USBFS_USBDEV_SIE_EP4_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP4_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP4_CR0 */
#define USBFS_USBDEV_SIE_EP4_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP4_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP4_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP4_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP4_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP4_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP4_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP4_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP4_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP4_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.SIE_EP5_CNT0 */
#define USBFS_USBDEV_SIE_EP5_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP5_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP5_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP5_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP5_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP5_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP5_CNT1 */
#define USBFS_USBDEV_SIE_EP5_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP5_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP5_CR0 */
#define USBFS_USBDEV_SIE_EP5_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP5_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP5_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP5_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP5_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP5_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP5_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP5_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP5_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP5_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.SIE_EP6_CNT0 */
#define USBFS_USBDEV_SIE_EP6_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP6_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP6_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP6_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP6_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP6_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP6_CNT1 */
#define USBFS_USBDEV_SIE_EP6_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP6_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP6_CR0 */
#define USBFS_USBDEV_SIE_EP6_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP6_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP6_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP6_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP6_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP6_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP6_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP6_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP6_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP6_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.SIE_EP7_CNT0 */
#define USBFS_USBDEV_SIE_EP7_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP7_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP7_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP7_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP7_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP7_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP7_CNT1 */
#define USBFS_USBDEV_SIE_EP7_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP7_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP7_CR0 */
#define USBFS_USBDEV_SIE_EP7_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP7_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP7_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP7_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP7_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP7_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP7_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP7_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP7_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP7_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.SIE_EP8_CNT0 */
#define USBFS_USBDEV_SIE_EP8_CNT0_DATA_COUNT_MSB_Pos 0UL
#define USBFS_USBDEV_SIE_EP8_CNT0_DATA_COUNT_MSB_Msk 0x7UL
#define USBFS_USBDEV_SIE_EP8_CNT0_DATA_VALID_Pos 6UL
#define USBFS_USBDEV_SIE_EP8_CNT0_DATA_VALID_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP8_CNT0_DATA_TOGGLE_Pos 7UL
#define USBFS_USBDEV_SIE_EP8_CNT0_DATA_TOGGLE_Msk 0x80UL
/* USBFS_USBDEV.SIE_EP8_CNT1 */
#define USBFS_USBDEV_SIE_EP8_CNT1_DATA_COUNT_Pos 0UL
#define USBFS_USBDEV_SIE_EP8_CNT1_DATA_COUNT_Msk 0xFFUL
/* USBFS_USBDEV.SIE_EP8_CR0 */
#define USBFS_USBDEV_SIE_EP8_CR0_MODE_Pos       0UL
#define USBFS_USBDEV_SIE_EP8_CR0_MODE_Msk       0xFUL
#define USBFS_USBDEV_SIE_EP8_CR0_ACKED_TXN_Pos  4UL
#define USBFS_USBDEV_SIE_EP8_CR0_ACKED_TXN_Msk  0x10UL
#define USBFS_USBDEV_SIE_EP8_CR0_NAK_INT_EN_Pos 5UL
#define USBFS_USBDEV_SIE_EP8_CR0_NAK_INT_EN_Msk 0x20UL
#define USBFS_USBDEV_SIE_EP8_CR0_ERR_IN_TXN_Pos 6UL
#define USBFS_USBDEV_SIE_EP8_CR0_ERR_IN_TXN_Msk 0x40UL
#define USBFS_USBDEV_SIE_EP8_CR0_STALL_Pos      7UL
#define USBFS_USBDEV_SIE_EP8_CR0_STALL_Msk      0x80UL
/* USBFS_USBDEV.ARB_EP1_CFG */
#define USBFS_USBDEV_ARB_EP1_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP1_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP1_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP1_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP1_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP1_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP1_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP1_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP1_INT_EN */
#define USBFS_USBDEV_ARB_EP1_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP1_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP1_SR */
#define USBFS_USBDEV_ARB_EP1_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP1_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP1_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP1_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP1_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP1_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP1_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP1_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP1_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP1_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW1_WA */
#define USBFS_USBDEV_ARB_RW1_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW1_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW1_WA_MSB */
#define USBFS_USBDEV_ARB_RW1_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW1_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW1_RA */
#define USBFS_USBDEV_ARB_RW1_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW1_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW1_RA_MSB */
#define USBFS_USBDEV_ARB_RW1_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW1_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW1_DR */
#define USBFS_USBDEV_ARB_RW1_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW1_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.BUF_SIZE */
#define USBFS_USBDEV_BUF_SIZE_IN_BUF_Pos        0UL
#define USBFS_USBDEV_BUF_SIZE_IN_BUF_Msk        0xFUL
#define USBFS_USBDEV_BUF_SIZE_OUT_BUF_Pos       4UL
#define USBFS_USBDEV_BUF_SIZE_OUT_BUF_Msk       0xF0UL
/* USBFS_USBDEV.EP_ACTIVE */
#define USBFS_USBDEV_EP_ACTIVE_EP1_ACT_Pos      0UL
#define USBFS_USBDEV_EP_ACTIVE_EP1_ACT_Msk      0x1UL
#define USBFS_USBDEV_EP_ACTIVE_EP2_ACT_Pos      1UL
#define USBFS_USBDEV_EP_ACTIVE_EP2_ACT_Msk      0x2UL
#define USBFS_USBDEV_EP_ACTIVE_EP3_ACT_Pos      2UL
#define USBFS_USBDEV_EP_ACTIVE_EP3_ACT_Msk      0x4UL
#define USBFS_USBDEV_EP_ACTIVE_EP4_ACT_Pos      3UL
#define USBFS_USBDEV_EP_ACTIVE_EP4_ACT_Msk      0x8UL
#define USBFS_USBDEV_EP_ACTIVE_EP5_ACT_Pos      4UL
#define USBFS_USBDEV_EP_ACTIVE_EP5_ACT_Msk      0x10UL
#define USBFS_USBDEV_EP_ACTIVE_EP6_ACT_Pos      5UL
#define USBFS_USBDEV_EP_ACTIVE_EP6_ACT_Msk      0x20UL
#define USBFS_USBDEV_EP_ACTIVE_EP7_ACT_Pos      6UL
#define USBFS_USBDEV_EP_ACTIVE_EP7_ACT_Msk      0x40UL
#define USBFS_USBDEV_EP_ACTIVE_EP8_ACT_Pos      7UL
#define USBFS_USBDEV_EP_ACTIVE_EP8_ACT_Msk      0x80UL
/* USBFS_USBDEV.EP_TYPE */
#define USBFS_USBDEV_EP_TYPE_EP1_TYP_Pos        0UL
#define USBFS_USBDEV_EP_TYPE_EP1_TYP_Msk        0x1UL
#define USBFS_USBDEV_EP_TYPE_EP2_TYP_Pos        1UL
#define USBFS_USBDEV_EP_TYPE_EP2_TYP_Msk        0x2UL
#define USBFS_USBDEV_EP_TYPE_EP3_TYP_Pos        2UL
#define USBFS_USBDEV_EP_TYPE_EP3_TYP_Msk        0x4UL
#define USBFS_USBDEV_EP_TYPE_EP4_TYP_Pos        3UL
#define USBFS_USBDEV_EP_TYPE_EP4_TYP_Msk        0x8UL
#define USBFS_USBDEV_EP_TYPE_EP5_TYP_Pos        4UL
#define USBFS_USBDEV_EP_TYPE_EP5_TYP_Msk        0x10UL
#define USBFS_USBDEV_EP_TYPE_EP6_TYP_Pos        5UL
#define USBFS_USBDEV_EP_TYPE_EP6_TYP_Msk        0x20UL
#define USBFS_USBDEV_EP_TYPE_EP7_TYP_Pos        6UL
#define USBFS_USBDEV_EP_TYPE_EP7_TYP_Msk        0x40UL
#define USBFS_USBDEV_EP_TYPE_EP8_TYP_Pos        7UL
#define USBFS_USBDEV_EP_TYPE_EP8_TYP_Msk        0x80UL
/* USBFS_USBDEV.ARB_EP2_CFG */
#define USBFS_USBDEV_ARB_EP2_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP2_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP2_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP2_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP2_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP2_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP2_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP2_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP2_INT_EN */
#define USBFS_USBDEV_ARB_EP2_INT_EN_IN_BUF_FULL_EN_Pos 0UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_IN_BUF_FULL_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_DMA_GNT_EN_Pos 1UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_DMA_GNT_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_BUF_OVER_EN_Pos 2UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_BUF_OVER_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_BUF_UNDER_EN_Pos 3UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_BUF_UNDER_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_ERR_INT_EN_Pos 4UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_ERR_INT_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_DMA_TERMIN_EN_Pos 5UL
#define USBFS_USBDEV_ARB_EP2_INT_EN_DMA_TERMIN_EN_Msk 0x20UL
/* USBFS_USBDEV.ARB_EP2_SR */
#define USBFS_USBDEV_ARB_EP2_SR_IN_BUF_FULL_Pos 0UL
#define USBFS_USBDEV_ARB_EP2_SR_IN_BUF_FULL_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP2_SR_DMA_GNT_Pos     1UL
#define USBFS_USBDEV_ARB_EP2_SR_DMA_GNT_Msk     0x2UL
#define USBFS_USBDEV_ARB_EP2_SR_BUF_OVER_Pos    2UL
#define USBFS_USBDEV_ARB_EP2_SR_BUF_OVER_Msk    0x4UL
#define USBFS_USBDEV_ARB_EP2_SR_BUF_UNDER_Pos   3UL
#define USBFS_USBDEV_ARB_EP2_SR_BUF_UNDER_Msk   0x8UL
#define USBFS_USBDEV_ARB_EP2_SR_DMA_TERMIN_Pos  5UL
#define USBFS_USBDEV_ARB_EP2_SR_DMA_TERMIN_Msk  0x20UL
/* USBFS_USBDEV.ARB_RW2_WA */
#define USBFS_USBDEV_ARB_RW2_WA_WA_Pos          0UL
#define USBFS_USBDEV_ARB_RW2_WA_WA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW2_WA_MSB */
#define USBFS_USBDEV_ARB_RW2_WA_MSB_WA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW2_WA_MSB_WA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW2_RA */
#define USBFS_USBDEV_ARB_RW2_RA_RA_Pos          0UL
#define USBFS_USBDEV_ARB_RW2_RA_RA_Msk          0xFFUL
/* USBFS_USBDEV.ARB_RW2_RA_MSB */
#define USBFS_USBDEV_ARB_RW2_RA_MSB_RA_MSB_Pos  0UL
#define USBFS_USBDEV_ARB_RW2_RA_MSB_RA_MSB_Msk  0x1UL
/* USBFS_USBDEV.ARB_RW2_DR */
#define USBFS_USBDEV_ARB_RW2_DR_DR_Pos          0UL
#define USBFS_USBDEV_ARB_RW2_DR_DR_Msk          0xFFUL
/* USBFS_USBDEV.ARB_CFG */
#define USBFS_USBDEV_ARB_CFG_AUTO_MEM_Pos       4UL
#define USBFS_USBDEV_ARB_CFG_AUTO_MEM_Msk       0x10UL
#define USBFS_USBDEV_ARB_CFG_DMA_CFG_Pos        5UL
#define USBFS_USBDEV_ARB_CFG_DMA_CFG_Msk        0x60UL
#define USBFS_USBDEV_ARB_CFG_CFG_CMP_Pos        7UL
#define USBFS_USBDEV_ARB_CFG_CFG_CMP_Msk        0x80UL
/* USBFS_USBDEV.USB_CLK_EN */
#define USBFS_USBDEV_USB_CLK_EN_CSR_CLK_EN_Pos  0UL
#define USBFS_USBDEV_USB_CLK_EN_CSR_CLK_EN_Msk  0x1UL
/* USBFS_USBDEV.ARB_INT_EN */
#define USBFS_USBDEV_ARB_INT_EN_EP1_INTR_EN_Pos 0UL
#define USBFS_USBDEV_ARB_INT_EN_EP1_INTR_EN_Msk 0x1UL
#define USBFS_USBDEV_ARB_INT_EN_EP2_INTR_EN_Pos 1UL
#define USBFS_USBDEV_ARB_INT_EN_EP2_INTR_EN_Msk 0x2UL
#define USBFS_USBDEV_ARB_INT_EN_EP3_INTR_EN_Pos 2UL
#define USBFS_USBDEV_ARB_INT_EN_EP3_INTR_EN_Msk 0x4UL
#define USBFS_USBDEV_ARB_INT_EN_EP4_INTR_EN_Pos 3UL
#define USBFS_USBDEV_ARB_INT_EN_EP4_INTR_EN_Msk 0x8UL
#define USBFS_USBDEV_ARB_INT_EN_EP5_INTR_EN_Pos 4UL
#define USBFS_USBDEV_ARB_INT_EN_EP5_INTR_EN_Msk 0x10UL
#define USBFS_USBDEV_ARB_INT_EN_EP6_INTR_EN_Pos 5UL
#define USBFS_USBDEV_ARB_INT_EN_EP6_INTR_EN_Msk 0x20UL
#define USBFS_USBDEV_ARB_INT_EN_EP7_INTR_EN_Pos 6UL
#define USBFS_USBDEV_ARB_INT_EN_EP7_INTR_EN_Msk 0x40UL
#define USBFS_USBDEV_ARB_INT_EN_EP8_INTR_EN_Pos 7UL
#define USBFS_USBDEV_ARB_INT_EN_EP8_INTR_EN_Msk 0x80UL
/* USBFS_USBDEV.ARB_INT_SR */
#define USBFS_USBDEV_ARB_INT_SR_EP1_INTR_Pos    0UL
#define USBFS_USBDEV_ARB_INT_SR_EP1_INTR_Msk    0x1UL
#define USBFS_USBDEV_ARB_INT_SR_EP2_INTR_Pos    1UL
#define USBFS_USBDEV_ARB_INT_SR_EP2_INTR_Msk    0x2UL
#define USBFS_USBDEV_ARB_INT_SR_EP3_INTR_Pos    2UL
#define USBFS_USBDEV_ARB_INT_SR_EP3_INTR_Msk    0x4UL
#define USBFS_USBDEV_ARB_INT_SR_EP4_INTR_Pos    3UL
#define USBFS_USBDEV_ARB_INT_SR_EP4_INTR_Msk    0x8UL
#define USBFS_USBDEV_ARB_INT_SR_EP5_INTR_Pos    4UL
#define USBFS_USBDEV_ARB_INT_SR_EP5_INTR_Msk    0x10UL
#define USBFS_USBDEV_ARB_INT_SR_EP6_INTR_Pos    5UL
#define USBFS_USBDEV_ARB_INT_SR_EP6_INTR_Msk    0x20UL
#define USBFS_USBDEV_ARB_INT_SR_EP7_INTR_Pos    6UL
#define USBFS_USBDEV_ARB_INT_SR_EP7_INTR_Msk    0x40UL
#define USBFS_USBDEV_ARB_INT_SR_EP8_INTR_Pos    7UL
#define USBFS_USBDEV_ARB_INT_SR_EP8_INTR_Msk    0x80UL
/* USBFS_USBDEV.ARB_EP3_CFG */
#define USBFS_USBDEV_ARB_EP3_CFG_IN_DATA_RDY_Pos 0UL
#define USBFS_USBDEV_ARB_EP3_CFG_IN_DATA_RDY_Msk 0x1UL
#define USBFS_USBDEV_ARB_EP3_CFG_DMA_REQ_Pos    1UL
#define USBFS_USBDEV_ARB_EP3_CFG_DMA_REQ_Msk    0x2UL
#define USBFS_USBDEV_ARB_EP3_CFG_CRC_BYPASS_Pos 2UL
#define USBFS_USBDEV_ARB_EP3_CFG_CRC_BYPASS_Msk 0x4UL
#define USBFS_USBDEV_ARB_EP3_CFG_RESET_PTR_Pos  3UL
#define USBFS_USBDEV_ARB_EP3_CFG_RESET_PTR_Msk  0x8UL
/* USBFS_USBDEV.ARB_EP3_INT_EN */
#define USBFS_USBDEV_ARB_EP3_INT_EN_IN_BUF_FULL_EN_Pos 0UL
