zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_usbfs.h
/* USBFS_USBLPM.POWER_CTL */
#define USBFS_USBLPM_POWER_CTL_SUSPEND_Pos      2UL
#define USBFS_USBLPM_POWER_CTL_SUSPEND_Msk      0x4UL
#define USBFS_USBLPM_POWER_CTL_DP_UP_EN_Pos     16UL
#define USBFS_USBLPM_POWER_CTL_DP_UP_EN_Msk     0x10000UL
#define USBFS_USBLPM_POWER_CTL_DP_BIG_Pos       17UL
#define USBFS_USBLPM_POWER_CTL_DP_BIG_Msk       0x20000UL
#define USBFS_USBLPM_POWER_CTL_DP_DOWN_EN_Pos   18UL
#define USBFS_USBLPM_POWER_CTL_DP_DOWN_EN_Msk   0x40000UL
#define USBFS_USBLPM_POWER_CTL_DM_UP_EN_Pos     19UL
#define USBFS_USBLPM_POWER_CTL_DM_UP_EN_Msk     0x80000UL
#define USBFS_USBLPM_POWER_CTL_DM_BIG_Pos       20UL
#define USBFS_USBLPM_POWER_CTL_DM_BIG_Msk       0x100000UL
#define USBFS_USBLPM_POWER_CTL_DM_DOWN_EN_Pos   21UL
#define USBFS_USBLPM_POWER_CTL_DM_DOWN_EN_Msk   0x200000UL
#define USBFS_USBLPM_POWER_CTL_ENABLE_DPO_Pos   28UL
#define USBFS_USBLPM_POWER_CTL_ENABLE_DPO_Msk   0x10000000UL
#define USBFS_USBLPM_POWER_CTL_ENABLE_DMO_Pos   29UL
#define USBFS_USBLPM_POWER_CTL_ENABLE_DMO_Msk   0x20000000UL
/* USBFS_USBLPM.USBIO_CTL */
#define USBFS_USBLPM_USBIO_CTL_DM_P_Pos         0UL
#define USBFS_USBLPM_USBIO_CTL_DM_P_Msk         0x7UL
#define USBFS_USBLPM_USBIO_CTL_DM_M_Pos         3UL
#define USBFS_USBLPM_USBIO_CTL_DM_M_Msk         0x38UL
/* USBFS_USBLPM.FLOW_CTL */
#define USBFS_USBLPM_FLOW_CTL_EP1_ERR_RESP_Pos  0UL
#define USBFS_USBLPM_FLOW_CTL_EP1_ERR_RESP_Msk  0x1UL
#define USBFS_USBLPM_FLOW_CTL_EP2_ERR_RESP_Pos  1UL
#define USBFS_USBLPM_FLOW_CTL_EP2_ERR_RESP_Msk  0x2UL
#define USBFS_USBLPM_FLOW_CTL_EP3_ERR_RESP_Pos  2UL
#define USBFS_USBLPM_FLOW_CTL_EP3_ERR_RESP_Msk  0x4UL
#define USBFS_USBLPM_FLOW_CTL_EP4_ERR_RESP_Pos  3UL
#define USBFS_USBLPM_FLOW_CTL_EP4_ERR_RESP_Msk  0x8UL
#define USBFS_USBLPM_FLOW_CTL_EP5_ERR_RESP_Pos  4UL
#define USBFS_USBLPM_FLOW_CTL_EP5_ERR_RESP_Msk  0x10UL
#define USBFS_USBLPM_FLOW_CTL_EP6_ERR_RESP_Pos  5UL
#define USBFS_USBLPM_FLOW_CTL_EP6_ERR_RESP_Msk  0x20UL
#define USBFS_USBLPM_FLOW_CTL_EP7_ERR_RESP_Pos  6UL
#define USBFS_USBLPM_FLOW_CTL_EP7_ERR_RESP_Msk  0x40UL
#define USBFS_USBLPM_FLOW_CTL_EP8_ERR_RESP_Pos  7UL
#define USBFS_USBLPM_FLOW_CTL_EP8_ERR_RESP_Msk  0x80UL
/* USBFS_USBLPM.LPM_CTL */
#define USBFS_USBLPM_LPM_CTL_LPM_EN_Pos         0UL
#define USBFS_USBLPM_LPM_CTL_LPM_EN_Msk         0x1UL
#define USBFS_USBLPM_LPM_CTL_LPM_ACK_RESP_Pos   1UL
#define USBFS_USBLPM_LPM_CTL_LPM_ACK_RESP_Msk   0x2UL
#define USBFS_USBLPM_LPM_CTL_NYET_EN_Pos        2UL
#define USBFS_USBLPM_LPM_CTL_NYET_EN_Msk        0x4UL
#define USBFS_USBLPM_LPM_CTL_SUB_RESP_Pos       4UL
#define USBFS_USBLPM_LPM_CTL_SUB_RESP_Msk       0x10UL
/* USBFS_USBLPM.LPM_STAT */
#define USBFS_USBLPM_LPM_STAT_LPM_BESL_Pos      0UL
#define USBFS_USBLPM_LPM_STAT_LPM_BESL_Msk      0xFUL
#define USBFS_USBLPM_LPM_STAT_LPM_REMOTEWAKE_Pos 4UL
#define USBFS_USBLPM_LPM_STAT_LPM_REMOTEWAKE_Msk 0x10UL
/* USBFS_USBLPM.INTR_SIE */
#define USBFS_USBLPM_INTR_SIE_SOF_INTR_Pos      0UL
#define USBFS_USBLPM_INTR_SIE_SOF_INTR_Msk      0x1UL
#define USBFS_USBLPM_INTR_SIE_BUS_RESET_INTR_Pos 1UL
#define USBFS_USBLPM_INTR_SIE_BUS_RESET_INTR_Msk 0x2UL
#define USBFS_USBLPM_INTR_SIE_EP0_INTR_Pos      2UL
#define USBFS_USBLPM_INTR_SIE_EP0_INTR_Msk      0x4UL
#define USBFS_USBLPM_INTR_SIE_LPM_INTR_Pos      3UL
#define USBFS_USBLPM_INTR_SIE_LPM_INTR_Msk      0x8UL
#define USBFS_USBLPM_INTR_SIE_RESUME_INTR_Pos   4UL
#define USBFS_USBLPM_INTR_SIE_RESUME_INTR_Msk   0x10UL
/* USBFS_USBLPM.INTR_SIE_SET */
#define USBFS_USBLPM_INTR_SIE_SET_SOF_INTR_SET_Pos 0UL
#define USBFS_USBLPM_INTR_SIE_SET_SOF_INTR_SET_Msk 0x1UL
#define USBFS_USBLPM_INTR_SIE_SET_BUS_RESET_INTR_SET_Pos 1UL
#define USBFS_USBLPM_INTR_SIE_SET_BUS_RESET_INTR_SET_Msk 0x2UL
#define USBFS_USBLPM_INTR_SIE_SET_EP0_INTR_SET_Pos 2UL
#define USBFS_USBLPM_INTR_SIE_SET_EP0_INTR_SET_Msk 0x4UL
#define USBFS_USBLPM_INTR_SIE_SET_LPM_INTR_SET_Pos 3UL
#define USBFS_USBLPM_INTR_SIE_SET_LPM_INTR_SET_Msk 0x8UL
#define USBFS_USBLPM_INTR_SIE_SET_RESUME_INTR_SET_Pos 4UL
#define USBFS_USBLPM_INTR_SIE_SET_RESUME_INTR_SET_Msk 0x10UL
/* USBFS_USBLPM.INTR_SIE_MASK */
#define USBFS_USBLPM_INTR_SIE_MASK_SOF_INTR_MASK_Pos 0UL
#define USBFS_USBLPM_INTR_SIE_MASK_SOF_INTR_MASK_Msk 0x1UL
#define USBFS_USBLPM_INTR_SIE_MASK_BUS_RESET_INTR_MASK_Pos 1UL
#define USBFS_USBLPM_INTR_SIE_MASK_BUS_RESET_INTR_MASK_Msk 0x2UL
#define USBFS_USBLPM_INTR_SIE_MASK_EP0_INTR_MASK_Pos 2UL
#define USBFS_USBLPM_INTR_SIE_MASK_EP0_INTR_MASK_Msk 0x4UL
#define USBFS_USBLPM_INTR_SIE_MASK_LPM_INTR_MASK_Pos 3UL
#define USBFS_USBLPM_INTR_SIE_MASK_LPM_INTR_MASK_Msk 0x8UL
#define USBFS_USBLPM_INTR_SIE_MASK_RESUME_INTR_MASK_Pos 4UL
#define USBFS_USBLPM_INTR_SIE_MASK_RESUME_INTR_MASK_Msk 0x10UL
/* USBFS_USBLPM.INTR_SIE_MASKED */
#define USBFS_USBLPM_INTR_SIE_MASKED_SOF_INTR_MASKED_Pos 0UL
#define USBFS_USBLPM_INTR_SIE_MASKED_SOF_INTR_MASKED_Msk 0x1UL
#define USBFS_USBLPM_INTR_SIE_MASKED_BUS_RESET_INTR_MASKED_Pos 1UL
#define USBFS_USBLPM_INTR_SIE_MASKED_BUS_RESET_INTR_MASKED_Msk 0x2UL
#define USBFS_USBLPM_INTR_SIE_MASKED_EP0_INTR_MASKED_Pos 2UL
#define USBFS_USBLPM_INTR_SIE_MASKED_EP0_INTR_MASKED_Msk 0x4UL
#define USBFS_USBLPM_INTR_SIE_MASKED_LPM_INTR_MASKED_Pos 3UL
#define USBFS_USBLPM_INTR_SIE_MASKED_LPM_INTR_MASKED_Msk 0x8UL
#define USBFS_USBLPM_INTR_SIE_MASKED_RESUME_INTR_MASKED_Pos 4UL
#define USBFS_USBLPM_INTR_SIE_MASKED_RESUME_INTR_MASKED_Msk 0x10UL
/* USBFS_USBLPM.INTR_LVL_SEL */
#define USBFS_USBLPM_INTR_LVL_SEL_SOF_LVL_SEL_Pos 0UL
#define USBFS_USBLPM_INTR_LVL_SEL_SOF_LVL_SEL_Msk 0x3UL
#define USBFS_USBLPM_INTR_LVL_SEL_BUS_RESET_LVL_SEL_Pos 2UL
#define USBFS_USBLPM_INTR_LVL_SEL_BUS_RESET_LVL_SEL_Msk 0xCUL
#define USBFS_USBLPM_INTR_LVL_SEL_EP0_LVL_SEL_Pos 4UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP0_LVL_SEL_Msk 0x30UL
#define USBFS_USBLPM_INTR_LVL_SEL_LPM_LVL_SEL_Pos 6UL
#define USBFS_USBLPM_INTR_LVL_SEL_LPM_LVL_SEL_Msk 0xC0UL
#define USBFS_USBLPM_INTR_LVL_SEL_RESUME_LVL_SEL_Pos 8UL
#define USBFS_USBLPM_INTR_LVL_SEL_RESUME_LVL_SEL_Msk 0x300UL
#define USBFS_USBLPM_INTR_LVL_SEL_ARB_EP_LVL_SEL_Pos 14UL
#define USBFS_USBLPM_INTR_LVL_SEL_ARB_EP_LVL_SEL_Msk 0xC000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP1_LVL_SEL_Pos 16UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP1_LVL_SEL_Msk 0x30000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP2_LVL_SEL_Pos 18UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP2_LVL_SEL_Msk 0xC0000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP3_LVL_SEL_Pos 20UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP3_LVL_SEL_Msk 0x300000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP4_LVL_SEL_Pos 22UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP4_LVL_SEL_Msk 0xC00000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP5_LVL_SEL_Pos 24UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP5_LVL_SEL_Msk 0x3000000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP6_LVL_SEL_Pos 26UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP6_LVL_SEL_Msk 0xC000000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP7_LVL_SEL_Pos 28UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP7_LVL_SEL_Msk 0x30000000UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP8_LVL_SEL_Pos 30UL
#define USBFS_USBLPM_INTR_LVL_SEL_EP8_LVL_SEL_Msk 0xC0000000UL
/* USBFS_USBLPM.INTR_CAUSE_HI */
#define USBFS_USBLPM_INTR_CAUSE_HI_SOF_INTR_Pos 0UL
#define USBFS_USBLPM_INTR_CAUSE_HI_SOF_INTR_Msk 0x1UL
#define USBFS_USBLPM_INTR_CAUSE_HI_BUS_RESET_INTR_Pos 1UL
#define USBFS_USBLPM_INTR_CAUSE_HI_BUS_RESET_INTR_Msk 0x2UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP0_INTR_Pos 2UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP0_INTR_Msk 0x4UL
#define USBFS_USBLPM_INTR_CAUSE_HI_LPM_INTR_Pos 3UL
#define USBFS_USBLPM_INTR_CAUSE_HI_LPM_INTR_Msk 0x8UL
#define USBFS_USBLPM_INTR_CAUSE_HI_RESUME_INTR_Pos 4UL
#define USBFS_USBLPM_INTR_CAUSE_HI_RESUME_INTR_Msk 0x10UL
#define USBFS_USBLPM_INTR_CAUSE_HI_ARB_EP_INTR_Pos 7UL
#define USBFS_USBLPM_INTR_CAUSE_HI_ARB_EP_INTR_Msk 0x80UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP1_INTR_Pos 8UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP1_INTR_Msk 0x100UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP2_INTR_Pos 9UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP2_INTR_Msk 0x200UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP3_INTR_Pos 10UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP3_INTR_Msk 0x400UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP4_INTR_Pos 11UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP4_INTR_Msk 0x800UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP5_INTR_Pos 12UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP5_INTR_Msk 0x1000UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP6_INTR_Pos 13UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP6_INTR_Msk 0x2000UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP7_INTR_Pos 14UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP7_INTR_Msk 0x4000UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP8_INTR_Pos 15UL
#define USBFS_USBLPM_INTR_CAUSE_HI_EP8_INTR_Msk 0x8000UL
/* USBFS_USBLPM.INTR_CAUSE_MED */
#define USBFS_USBLPM_INTR_CAUSE_MED_SOF_INTR_Pos 0UL
#define USBFS_USBLPM_INTR_CAUSE_MED_SOF_INTR_Msk 0x1UL
#define USBFS_USBLPM_INTR_CAUSE_MED_BUS_RESET_INTR_Pos 1UL
#define USBFS_USBLPM_INTR_CAUSE_MED_BUS_RESET_INTR_Msk 0x2UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP0_INTR_Pos 2UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP0_INTR_Msk 0x4UL
#define USBFS_USBLPM_INTR_CAUSE_MED_LPM_INTR_Pos 3UL
#define USBFS_USBLPM_INTR_CAUSE_MED_LPM_INTR_Msk 0x8UL
#define USBFS_USBLPM_INTR_CAUSE_MED_RESUME_INTR_Pos 4UL
#define USBFS_USBLPM_INTR_CAUSE_MED_RESUME_INTR_Msk 0x10UL
#define USBFS_USBLPM_INTR_CAUSE_MED_ARB_EP_INTR_Pos 7UL
#define USBFS_USBLPM_INTR_CAUSE_MED_ARB_EP_INTR_Msk 0x80UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP1_INTR_Pos 8UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP1_INTR_Msk 0x100UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP2_INTR_Pos 9UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP2_INTR_Msk 0x200UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP3_INTR_Pos 10UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP3_INTR_Msk 0x400UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP4_INTR_Pos 11UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP4_INTR_Msk 0x800UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP5_INTR_Pos 12UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP5_INTR_Msk 0x1000UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP6_INTR_Pos 13UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP6_INTR_Msk 0x2000UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP7_INTR_Pos 14UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP7_INTR_Msk 0x4000UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP8_INTR_Pos 15UL
#define USBFS_USBLPM_INTR_CAUSE_MED_EP8_INTR_Msk 0x8000UL
/* USBFS_USBLPM.INTR_CAUSE_LO */
#define USBFS_USBLPM_INTR_CAUSE_LO_SOF_INTR_Pos 0UL
#define USBFS_USBLPM_INTR_CAUSE_LO_SOF_INTR_Msk 0x1UL
#define USBFS_USBLPM_INTR_CAUSE_LO_BUS_RESET_INTR_Pos 1UL
#define USBFS_USBLPM_INTR_CAUSE_LO_BUS_RESET_INTR_Msk 0x2UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP0_INTR_Pos 2UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP0_INTR_Msk 0x4UL
#define USBFS_USBLPM_INTR_CAUSE_LO_LPM_INTR_Pos 3UL
#define USBFS_USBLPM_INTR_CAUSE_LO_LPM_INTR_Msk 0x8UL
#define USBFS_USBLPM_INTR_CAUSE_LO_RESUME_INTR_Pos 4UL
#define USBFS_USBLPM_INTR_CAUSE_LO_RESUME_INTR_Msk 0x10UL
#define USBFS_USBLPM_INTR_CAUSE_LO_ARB_EP_INTR_Pos 7UL
#define USBFS_USBLPM_INTR_CAUSE_LO_ARB_EP_INTR_Msk 0x80UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP1_INTR_Pos 8UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP1_INTR_Msk 0x100UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP2_INTR_Pos 9UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP2_INTR_Msk 0x200UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP3_INTR_Pos 10UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP3_INTR_Msk 0x400UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP4_INTR_Pos 11UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP4_INTR_Msk 0x800UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP5_INTR_Pos 12UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP5_INTR_Msk 0x1000UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP6_INTR_Pos 13UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP6_INTR_Msk 0x2000UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP7_INTR_Pos 14UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP7_INTR_Msk 0x4000UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP8_INTR_Pos 15UL
#define USBFS_USBLPM_INTR_CAUSE_LO_EP8_INTR_Msk 0x8000UL
/* USBFS_USBLPM.DFT_CTL */
#define USBFS_USBLPM_DFT_CTL_DDFT_OUT_SEL_Pos   0UL
#define USBFS_USBLPM_DFT_CTL_DDFT_OUT_SEL_Msk   0x7UL
#define USBFS_USBLPM_DFT_CTL_DDFT_IN_SEL_Pos    3UL
#define USBFS_USBLPM_DFT_CTL_DDFT_IN_SEL_Msk    0x18UL


